Revit 2026 API

# ExportIFCCategoryInfoIFCEntityName Property

---

The name of the IFC entity mapped to a particular Revit category.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string IFCEntityName { get; set; }
```
```vb
Public Property IFCEntityName As String
	Get
	Set
```
```cpp
public:
property String^ IFCEntityName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member IFCEntityName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ExportIFCCategoryInfo Class

Autodesk.Revit.DB Namespace